1: kd> dt nt!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x000 GdtBase          : Ptr64 _KGDTENTRY64
   +0x008 TssBase          : Ptr64 _KTSS64
   +0x010 UserRsp          : Uint8B
   +0x018 Self             : Ptr64 _KPCR
   +0x020 CurrentPrcb      : Ptr64 _KPRCB
   +0x028 LockArray        : Ptr64 _KSPIN_LOCK_QUEUE
   +0x030 Used_Self        : Ptr64 Void
   +0x038 IdtBase          : Ptr64 _KIDTENTRY64
   +0x040 Unused           : [2] Uint8B
   +0x050 Irql             : UChar
   +0x051 SecondLevelCacheAssociativity : UChar
   +0x052 ObsoleteNumber   : UChar
   +0x053 Fill0            : UChar
   +0x054 Unused0          : [3] Uint4B
   +0x060 MajorVersion     : Uint2B
   +0x062 MinorVersion     : Uint2B
   +0x064 StallScaleFactor : Uint4B
   +0x068 Unused1          : [3] Ptr64 Void
   +0x080 KernelReserved   : [15] Uint4B
   +0x0bc SecondLevelCacheSize : Uint4B
   +0x0c0 HalReserved      : [16] Uint4B
   +0x100 Unused2          : Uint4B
   +0x108 KdVersionBlock   : Ptr64 Void
   +0x110 Unused3          : Ptr64 Void
   +0x118 PcrAlign1        : [24] Uint4B
   +0x180 Prcb             : _KPRCB

1: kd> dt nt!_KPRCB
   +0x000 MxCsr            : Uint4B
   +0x004 LegacyNumber     : UChar
   +0x005 ReservedMustBeZero : UChar
   +0x006 InterruptRequest : UChar
   +0x007 IdleHalt         : UChar
   +0x008 CurrentThread    : Ptr64 _KTHREAD
   +0x010 NextThread       : Ptr64 _KTHREAD
   +0x018 IdleThread       : Ptr64 _KTHREAD
   +0x020 NestingLevel     : UChar
   +0x021 ClockOwner       : UChar
   +0x022 PendingTickFlags : UChar
   +0x022 PendingTick      : Pos 0, 1 Bit
   +0x022 PendingBackupTick : Pos 1, 1 Bit
   +0x023 IdleState        : UChar
   +0x024 Number           : Uint4B
   +0x028 RspBase          : Uint8B
   +0x030 PrcbLock         : Uint8B
   +0x038 PriorityState    : Ptr64 Char
   +0x040 CpuType          : Char
   +0x041 CpuID            : Char
   +0x042 CpuStep          : Uint2B
   +0x042 CpuStepping      : UChar
   +0x043 CpuModel         : UChar
   +0x044 MHz              : Uint4B
   +0x048 HalReserved      : [8] Uint8B
   +0x088 MinorVersion     : Uint2B
   +0x08a MajorVersion     : Uint2B
   +0x08c BuildType        : UChar
   +0x08d CpuVendor        : UChar
   +0x08e CoresPerPhysicalProcessor : UChar
   +0x08f LogicalProcessorsPerCore : UChar
   +0x090 TscFrequency     : Uint8B
   +0x098 PrcbPad04        : [5] Uint8B
   +0x0c0 ParentNode       : Ptr64 _KNODE
   +0x0c8 GroupSetMember   : Uint8B
   +0x0d0 Group            : UChar
   +0x0d1 GroupIndex       : UChar
   +0x0d2 PrcbPad05        : [2] UChar
   +0x0d4 InitialApicId    : Uint4B
   +0x0d8 ScbOffset        : Uint4B
   +0x0dc ApicMask         : Uint4B
   +0x0e0 AcpiReserved     : Ptr64 Void
   +0x0e8 CFlushSize       : Uint4B
   +0x0ec PrcbFlags        : _KPRCBFLAG
   +0x0f0 TrappedSecurityDomain : Uint8B
   +0x0f8 BpbState         : UChar
   +0x0f8 BpbCpuIdle       : Pos 0, 1 Bit
   +0x0f8 BpbFlushRsbOnTrap : Pos 1, 1 Bit
   +0x0f8 BpbIbpbOnReturn  : Pos 2, 1 Bit
   +0x0f8 BpbIbpbOnTrap    : Pos 3, 1 Bit
   +0x0f8 BpbIbpbOnRetpolineExit : Pos 4, 1 Bit
   +0x0f8 BpbStateReserved : Pos 5, 3 Bits
   +0x0f9 BpbFeatures      : UChar
   +0x0f9 BpbClearOnIdle   : Pos 0, 1 Bit
   +0x0f9 BpbEnabled       : Pos 1, 1 Bit
   +0x0f9 BpbSmep          : Pos 2, 1 Bit
   +0x0f9 BpbFeaturesReserved : Pos 3, 5 Bits
   +0x0fa BpbCurrentSpecCtrl : UChar
   +0x0fb BpbKernelSpecCtrl : UChar
   +0x0fc BpbNmiSpecCtrl   : UChar
   +0x0fd BpbUserSpecCtrl  : UChar
   +0x0fe PairRegister     : Int2B
   +0x0f0 PrcbPad11        : [2] Uint8B
   +0x100 ProcessorState   : _KPROCESSOR_STATE
   +0x6c0 ExtendedSupervisorState : Ptr64 _XSAVE_AREA_HEADER
   +0x6c8 ProcessorSignature : Uint4B
   +0x6cc ProcessorFlags   : Uint4B
   +0x6d0 BpbRetpolineExitSpecCtrl : UChar
   +0x6d1 BpbTrappedRetpolineExitSpecCtrl : UChar
   +0x6d2 BpbTrappedBpbState : UChar
   +0x6d2 BpbTrappedCpuIdle : Pos 0, 1 Bit
   +0x6d2 BpbTrappedFlushRsbOnTrap : Pos 1, 1 Bit
   +0x6d2 BpbTrappedIbpbOnReturn : Pos 2, 1 Bit
   +0x6d2 BpbTrappedIbpbOnTrap : Pos 3, 1 Bit
   +0x6d2 BpbTrappedIbpbOnRetpolineExit : Pos 4, 1 Bit
   +0x6d2 BpbtrappedBpbStateReserved : Pos 5, 3 Bits
   +0x6d3 BpbRetpolineState : UChar
   +0x6d3 BpbRunningNonRetpolineCode : Pos 0, 1 Bit
   +0x6d3 BpbIndirectCallsSafe : Pos 1, 1 Bit
   +0x6d3 BpbRetpolineEnabled : Pos 2, 1 Bit
   +0x6d3 BpbRetpolineStateReserved : Pos 3, 5 Bits
   +0x6d4 PrcbPad12b       : Uint4B
   +0x6d0 PrcbPad12a       : Uint8B
   +0x6d8 PrcbPad12        : [3] Uint8B
   +0x6f0 LockQueue        : [17] _KSPIN_LOCK_QUEUE
   +0x800 PPLookasideList  : [16] _PP_LOOKASIDE_LIST
   +0x900 PPNxPagedLookasideList : [32] _GENERAL_LOOKASIDE_POOL
   +0x1500 PPNPagedLookasideList : [32] _GENERAL_LOOKASIDE_POOL
   +0x2100 PPPagedLookasideList : [32] _GENERAL_LOOKASIDE_POOL
   +0x2d00 MsrIa32TsxCtrl   : Uint8B
   +0x2d08 DeferredReadyListHead : _SINGLE_LIST_ENTRY
   +0x2d10 MmPageFaultCount : Int4B
   +0x2d14 MmCopyOnWriteCount : Int4B
   +0x2d18 MmTransitionCount : Int4B
   +0x2d1c MmDemandZeroCount : Int4B
   +0x2d20 MmPageReadCount  : Int4B
   +0x2d24 MmPageReadIoCount : Int4B
   +0x2d28 MmDirtyPagesWriteCount : Int4B
   +0x2d2c MmDirtyWriteIoCount : Int4B
   +0x2d30 MmMappedPagesWriteCount : Int4B
   +0x2d34 MmMappedWriteIoCount : Int4B
   +0x2d38 KeSystemCalls    : Uint4B
   +0x2d3c KeContextSwitches : Uint4B
   +0x2d40 PrcbPad40        : Uint4B
   +0x2d44 CcFastReadNoWait : Uint4B
   +0x2d48 CcFastReadWait   : Uint4B
   +0x2d4c CcFastReadNotPossible : Uint4B
   +0x2d50 CcCopyReadNoWait : Uint4B
   +0x2d54 CcCopyReadWait   : Uint4B
   +0x2d58 CcCopyReadNoWaitMiss : Uint4B
   +0x2d5c IoReadOperationCount : Int4B
   +0x2d60 IoWriteOperationCount : Int4B
   +0x2d64 IoOtherOperationCount : Int4B
   +0x2d68 IoReadTransferCount : _LARGE_INTEGER
   +0x2d70 IoWriteTransferCount : _LARGE_INTEGER
   +0x2d78 IoOtherTransferCount : _LARGE_INTEGER
   +0x2d80 PacketBarrier    : Int4B
   +0x2d84 TargetCount      : Int4B
   +0x2d88 IpiFrozen        : Uint4B
   +0x2d8c PrcbPad30        : Uint4B
   +0x2d90 IsrDpcStats      : Ptr64 Void
   +0x2d98 DeviceInterrupts : Uint4B
   +0x2d9c LookasideIrpFloat : Int4B
   +0x2da0 InterruptLastCount : Uint4B
   +0x2da4 InterruptRate    : Uint4B
   +0x2da8 LastNonHrTimerExpiration : Uint8B
   +0x2db0 PairPrcb         : Ptr64 _KPRCB
   +0x2db8 PrcbPad35        : [1] Uint8B
   +0x2dc0 InterruptObjectPool : _SLIST_HEADER
   +0x2dd0 PrcbPad41        : [6] Uint8B
   +0x2e00 DpcData          : [2] _KDPC_DATA
   +0x2e50 DpcStack         : Ptr64 Void
   +0x2e58 MaximumDpcQueueDepth : Int4B
   +0x2e5c DpcRequestRate   : Uint4B
   +0x2e60 MinimumDpcRate   : Uint4B
   +0x2e64 DpcLastCount     : Uint4B
   +0x2e68 ThreadDpcEnable  : UChar
   +0x2e69 QuantumEnd       : UChar
   +0x2e6a DpcRoutineActive : UChar
   +0x2e6b IdleSchedule     : UChar
   +0x2e6c DpcRequestSummary : Int4B
   +0x2e6c DpcRequestSlot   : [2] Int2B
   +0x2e6c NormalDpcState   : Int2B
   +0x2e6e ThreadDpcState   : Int2B
   +0x2e6c DpcNormalProcessingActive : Pos 0, 1 Bit
   +0x2e6c DpcNormalProcessingRequested : Pos 1, 1 Bit
   +0x2e6c DpcNormalThreadSignal : Pos 2, 1 Bit
   +0x2e6c DpcNormalTimerExpiration : Pos 3, 1 Bit
   +0x2e6c DpcNormalDpcPresent : Pos 4, 1 Bit
   +0x2e6c DpcNormalLocalInterrupt : Pos 5, 1 Bit
   +0x2e6c DpcNormalSpare   : Pos 6, 10 Bits
   +0x2e6c DpcThreadActive  : Pos 16, 1 Bit
   +0x2e6c DpcThreadRequested : Pos 17, 1 Bit
   +0x2e6c DpcThreadSpare   : Pos 18, 14 Bits
   +0x2e70 LastTimerHand    : Uint4B
   +0x2e74 LastTick         : Uint4B
   +0x2e78 ClockInterrupts  : Uint4B
   +0x2e7c ReadyScanTick    : Uint4B
   +0x2e80 InterruptObject  : [256] Ptr64 Void
   +0x3680 TimerTable       : _KTIMER_TABLE
   +0x5880 DpcGate          : _KGATE
   +0x5898 PrcbPad52        : Ptr64 Void
   +0x58a0 CallDpc          : _KDPC
   +0x58e0 ClockKeepAlive   : Int4B
   +0x58e4 PrcbPad60        : [2] UChar
   +0x58e6 NmiActive        : Uint2B
   +0x58e8 DpcWatchdogPeriod : Int4B
   +0x58ec DpcWatchdogCount : Int4B
   +0x58f0 KeSpinLockOrdering : Int4B
   +0x58f4 DpcWatchdogProfileCumulativeDpcThreshold : Uint4B
   +0x58f8 CachedPtes       : Ptr64 Void
   +0x5900 WaitListHead     : _LIST_ENTRY
   +0x5910 WaitLock         : Uint8B
   +0x5918 ReadySummary     : Uint4B
   +0x591c AffinitizedSelectionMask : Int4B
   +0x5920 QueueIndex       : Uint4B
   +0x5924 PrcbPad75        : [3] Uint4B
   +0x5930 TimerExpirationDpc : _KDPC
   +0x5970 ScbQueue         : _RTL_RB_TREE
   +0x5980 DispatcherReadyListHead : [32] _LIST_ENTRY
   +0x5b80 InterruptCount   : Uint4B
   +0x5b84 KernelTime       : Uint4B
   +0x5b88 UserTime         : Uint4B
   +0x5b8c DpcTime          : Uint4B
   +0x5b90 InterruptTime    : Uint4B
   +0x5b94 AdjustDpcThreshold : Uint4B
   +0x5b98 DebuggerSavedIRQL : UChar
   +0x5b99 GroupSchedulingOverQuota : UChar
   +0x5b9a DeepSleep        : UChar
   +0x5b9b PrcbPad80        : UChar
   +0x5b9c DpcTimeCount     : Uint4B
   +0x5ba0 DpcTimeLimit     : Uint4B
   +0x5ba4 PeriodicCount    : Uint4B
   +0x5ba8 PeriodicBias     : Uint4B
   +0x5bac AvailableTime    : Uint4B
   +0x5bb0 KeExceptionDispatchCount : Uint4B
   +0x5bb4 ReadyThreadCount : Uint4B
   +0x5bb8 ReadyQueueExpectedRunTime : Uint8B
   +0x5bc0 StartCycles      : Uint8B
   +0x5bc8 TaggedCyclesStart : Uint8B
   +0x5bd0 TaggedCycles     : [2] Uint8B
   +0x5be0 GenerationTarget : Uint8B
   +0x5be8 AffinitizedCycles : Uint8B
   +0x5bf0 ImportantCycles  : Uint8B
   +0x5bf8 UnimportantCycles : Uint8B
   +0x5c00 DpcWatchdogProfileSingleDpcThreshold : Uint4B
   +0x5c04 MmSpinLockOrdering : Int4B
   +0x5c08 CachedStack      : Ptr64 Void
   +0x5c10 PageColor        : Uint4B
   +0x5c14 NodeColor        : Uint4B
   +0x5c18 NodeShiftedColor : Uint4B
   +0x5c1c SecondaryColorMask : Uint4B
   +0x5c20 PrcbPad81        : [6] UChar
   +0x5c26 ExceptionStackActive : UChar
   +0x5c27 TbFlushListActive : UChar
   +0x5c28 ExceptionStack   : Ptr64 Void
   +0x5c30 PrcbPad82        : [1] Uint8B
   +0x5c38 CycleTime        : Uint8B
   +0x5c40 Cycles           : [4] [2] Uint8B
   +0x5c80 CcFastMdlReadNoWait : Uint4B
   +0x5c84 CcFastMdlReadWait : Uint4B
   +0x5c88 CcFastMdlReadNotPossible : Uint4B
   +0x5c8c CcMapDataNoWait  : Uint4B
   +0x5c90 CcMapDataWait    : Uint4B
   +0x5c94 CcPinMappedDataCount : Uint4B
   +0x5c98 CcPinReadNoWait  : Uint4B
   +0x5c9c CcPinReadWait    : Uint4B
   +0x5ca0 CcMdlReadNoWait  : Uint4B
   +0x5ca4 CcMdlReadWait    : Uint4B
   +0x5ca8 CcLazyWriteHotSpots : Uint4B
   +0x5cac CcLazyWriteIos   : Uint4B
   +0x5cb0 CcLazyWritePages : Uint4B
   +0x5cb4 CcDataFlushes    : Uint4B
   +0x5cb8 CcDataPages      : Uint4B
   +0x5cbc CcLostDelayedWrites : Uint4B
   +0x5cc0 CcFastReadResourceMiss : Uint4B
   +0x5cc4 CcCopyReadWaitMiss : Uint4B
   +0x5cc8 CcFastMdlReadResourceMiss : Uint4B
   +0x5ccc CcMapDataNoWaitMiss : Uint4B
   +0x5cd0 CcMapDataWaitMiss : Uint4B
   +0x5cd4 CcPinReadNoWaitMiss : Uint4B
   +0x5cd8 CcPinReadWaitMiss : Uint4B
   +0x5cdc CcMdlReadNoWaitMiss : Uint4B
   +0x5ce0 CcMdlReadWaitMiss : Uint4B
   +0x5ce4 CcReadAheadIos   : Uint4B
   +0x5ce8 MmCacheTransitionCount : Int4B
   +0x5cec MmCacheReadCount : Int4B
   +0x5cf0 MmCacheIoCount   : Int4B
   +0x5cf4 PrcbPad91        : Uint4B
   +0x5cf8 MmInternal       : Ptr64 Void
   +0x5d00 PowerState       : _PROCESSOR_POWER_STATE
   +0x5f00 HyperPte         : Ptr64 Void
   +0x5f08 ScbList          : _LIST_ENTRY
   +0x5f18 ForceIdleDpc     : _KDPC
   +0x5f58 DpcWatchdogDpc   : _KDPC
   +0x5f98 DpcWatchdogTimer : _KTIMER
   +0x5fd8 Cache            : [5] _CACHE_DESCRIPTOR
   +0x6014 CacheCount       : Uint4B
   +0x6018 CachedCommit     : Uint4B
   +0x601c CachedResidentAvailable : Uint4B
   +0x6020 WheaInfo         : Ptr64 Void
   +0x6028 EtwSupport       : Ptr64 Void
   +0x6030 ExSaPageArray    : Ptr64 Void
   +0x6038 KeAlignmentFixupCount : Uint4B
   +0x603c PrcbPad95        : Uint4B
   +0x6040 HypercallPageList : _SLIST_HEADER
   +0x6050 StatisticsPage   : Ptr64 Uint8B
   +0x6058 PrcbPad85        : [5] Uint8B
   +0x6080 HypercallCachedPages : Ptr64 Void
   +0x6088 VirtualApicAssist : Ptr64 Void
   +0x6090 PackageProcessorSet : _KAFFINITY_EX
   +0x6138 PackageId        : Uint4B
   +0x613c PrcbPad86        : Uint4B
   +0x6140 SharedReadyQueueMask : Uint8B
   +0x6148 SharedReadyQueue : Ptr64 _KSHARED_READY_QUEUE
   +0x6150 SharedQueueScanOwner : Uint4B
   +0x6154 ScanSiblingIndex : Uint4B
   +0x6158 CoreProcessorSet : Uint8B
   +0x6160 ScanSiblingMask  : Uint8B
   +0x6168 LLCMask          : Uint8B
   +0x6170 CacheProcessorMask : [5] Uint8B
   +0x6198 ProcessorProfileControlArea : Ptr64 _PROCESSOR_PROFILE_CONTROL_AREA
   +0x61a0 ProfileEventIndexAddress : Ptr64 Void
   +0x61a8 DpcWatchdogProfile : Ptr64 Ptr64 Void
   +0x61b0 DpcWatchdogProfileCurrentEmptyCapture : Ptr64 Ptr64 Void
   +0x61b8 SchedulerAssist  : Ptr64 Void
   +0x61c0 SynchCounters    : _SYNCH_COUNTERS
   +0x6278 PrcbPad94        : Uint8B
   +0x6280 FsCounters       : _FILESYSTEM_DISK_COUNTERS
   +0x6290 VendorString     : [13] UChar
   +0x629d PrcbPad100       : [3] UChar
   +0x62a0 FeatureBits      : Uint8B
   +0x62a8 UpdateSignature  : _LARGE_INTEGER
   +0x62b0 PteBitCache      : Uint8B
   +0x62b8 PteBitOffset     : Uint4B
   +0x62bc PrcbPad105       : Uint4B
   +0x62c0 Context          : Ptr64 _CONTEXT
   +0x62c8 ContextFlagsInit : Uint4B
   +0x62cc PrcbPad115       : Uint4B
   +0x62d0 ExtendedState    : Ptr64 _XSAVE_AREA
   +0x62d8 IsrStack         : Ptr64 Void
   +0x62e0 EntropyTimingState : _KENTROPY_TIMING_STATE
   +0x6430 PrcbPad110       : Uint8B
   +0x6438 StibpPairingTrace : <anonymous-tag>
   +0x6470 AbSelfIoBoostsList : _SINGLE_LIST_ENTRY
   +0x6478 AbPropagateBoostsList : _SINGLE_LIST_ENTRY
   +0x6480 AbDpc            : _KDPC
   +0x64c0 IoIrpStackProfilerCurrent : _IOP_IRP_STACK_PROFILER
   +0x6514 IoIrpStackProfilerPrevious : _IOP_IRP_STACK_PROFILER
   +0x6568 SecureFault      : _KSECURE_FAULT_INFORMATION
   +0x6578 PrcbPad120       : Uint8B
   +0x6580 LocalSharedReadyQueue : _KSHARED_READY_QUEUE
   +0x67f0 PrcbPad125       : [2] Uint8B
   +0x6800 TimerExpirationTraceCount : Uint4B
   +0x6804 PrcbPad127       : Uint4B
   +0x6808 TimerExpirationTrace : [16] _KTIMER_EXPIRATION_TRACE
   +0x6908 PrcbPad128       : [7] Uint8B
   +0x6940 Mailbox          : Ptr64 _REQUEST_MAILBOX
   +0x6948 PrcbPad130       : [7] Uint8B
   +0x6980 McheckContext    : [2] _MACHINE_CHECK_CONTEXT
   +0x6a20 PrcbPad134       : [4] Uint8B
   +0x6a40 SelfmapLockHandle : [4] _KLOCK_QUEUE_HANDLE
   +0x6aa0 PrcbPad134a      : [4] Uint8B
   +0x6ac0 PrcbPad138       : [896] UChar
   +0x6e40 PrcbPad138a      : [64] UChar
   +0x6e80 KernelDirectoryTableBase : Uint8B
   +0x6e88 RspBaseShadow    : Uint8B
   +0x6e90 UserRspShadow    : Uint8B
   +0x6e98 ShadowFlags      : Uint4B
   +0x6e9c PrcbPad138b      : Uint4B
   +0x6ea0 PrcbPad138c      : Uint8B
   +0x6ea8 PrcbPad138d      : Uint2B
   +0x6eaa VerwSelector     : Uint2B
   +0x6eac PrcbPad139       : Uint4B
   +0x6eb0 DbgMceNestingLevel : Uint4B
   +0x6eb4 DbgMceFlags      : Uint4B
   +0x6eb8 PrcbPad140       : [505] Uint8B
   +0x7e80 PrcbPad140a      : [8] Uint8B
   +0x7ec0 PrcbPad141       : [504] Uint8B
   +0x8e80 PrcbPad141a      : [64] UChar
   +0x8ec0 RequestMailbox   : [1] _REQUEST_MAILBOX


.sympath srv*c:\MyServerSymbols*https://msdl.microsoft.com/download/symbols

0:000:x86> dt _PEB
ntdll!_PEB
   +0x000 InheritedAddressSpace : UChar
   +0x001 ReadImageFileExecOptions : UChar
   +0x002 BeingDebugged    : UChar
   +0x003 BitField         : UChar
   +0x003 ImageUsesLargePages : Pos 0, 1 Bit
   +0x003 IsProtectedProcess : Pos 1, 1 Bit
   +0x003 IsLegacyProcess  : Pos 2, 1 Bit
   +0x003 IsImageDynamicallyRelocated : Pos 3, 1 Bit
   +0x003 SkipPatchingUser32Forwarders : Pos 4, 1 Bit
   +0x003 SpareBits        : Pos 5, 3 Bits
   +0x008 Mutant           : Ptr64 Void
   +0x010 ImageBaseAddress : Ptr64 Void
   +0x018 Ldr              : Ptr64 _PEB_LDR_DATA
   +0x020 ProcessParameters : Ptr64 _RTL_USER_PROCESS_PARAMETERS
   +0x028 SubSystemData    : Ptr64 Void
   +0x030 ProcessHeap      : Ptr64 Void
   +0x038 FastPebLock      : Ptr64 _RTL_CRITICAL_SECTION
   +0x040 AtlThunkSListPtr : Ptr64 Void
   +0x048 IFEOKey          : Ptr64 Void
   +0x050 CrossProcessFlags : Uint4B
   +0x050 ProcessInJob     : Pos 0, 1 Bit
   +0x050 ProcessInitializing : Pos 1, 1 Bit
   +0x050 ProcessUsingVEH  : Pos 2, 1 Bit
   +0x050 ProcessUsingVCH  : Pos 3, 1 Bit
   +0x050 ProcessUsingFTH  : Pos 4, 1 Bit
   +0x050 ReservedBits0    : Pos 5, 27 Bits
   +0x058 KernelCallbackTable : Ptr64 Void
   +0x058 UserSharedInfoPtr : Ptr64 Void
   +0x060 SystemReserved   : [1] Uint4B
   +0x064 AtlThunkSListPtr32 : Uint4B
   +0x068 ApiSetMap        : Ptr64 Void
   +0x070 TlsExpansionCounter : Uint4B
   +0x078 TlsBitmap        : Ptr64 Void
   +0x080 TlsBitmapBits    : [2] Uint4B
   +0x088 ReadOnlySharedMemoryBase : Ptr64 Void
   +0x090 HotpatchInformation : Ptr64 Void
   +0x098 ReadOnlyStaticServerData : Ptr64 Ptr64 Void
   +0x0a0 AnsiCodePageData : Ptr64 Void
   +0x0a8 OemCodePageData  : Ptr64 Void
   +0x0b0 UnicodeCaseTableData : Ptr64 Void
   +0x0b8 NumberOfProcessors : Uint4B
   +0x0bc NtGlobalFlag     : Uint4B
   +0x0c0 CriticalSectionTimeout : _LARGE_INTEGER
   +0x0c8 HeapSegmentReserve : Uint8B
   +0x0d0 HeapSegmentCommit : Uint8B
   +0x0d8 HeapDeCommitTotalFreeThreshold : Uint8B
   +0x0e0 HeapDeCommitFreeBlockThreshold : Uint8B
   +0x0e8 NumberOfHeaps    : Uint4B
   +0x0ec MaximumNumberOfHeaps : Uint4B
   +0x0f0 ProcessHeaps     : Ptr64 Ptr64 Void
   +0x0f8 GdiSharedHandleTable : Ptr64 Void
   +0x100 ProcessStarterHelper : Ptr64 Void
   +0x108 GdiDCAttributeList : Uint4B
   +0x110 LoaderLock       : Ptr64 _RTL_CRITICAL_SECTION
   +0x118 OSMajorVersion   : Uint4B
   +0x11c OSMinorVersion   : Uint4B
   +0x120 OSBuildNumber    : Uint2B
   +0x122 OSCSDVersion     : Uint2B
   +0x124 OSPlatformId     : Uint4B
   +0x128 ImageSubsystem   : Uint4B
   +0x12c ImageSubsystemMajorVersion : Uint4B
   +0x130 ImageSubsystemMinorVersion : Uint4B
   +0x138 ActiveProcessAffinityMask : Uint8B
   +0x140 GdiHandleBuffer  : [60] Uint4B
   +0x230 PostProcessInitRoutine : Ptr64     void 
   +0x238 TlsExpansionBitmap : Ptr64 Void
   +0x240 TlsExpansionBitmapBits : [32] Uint4B
   +0x2c0 SessionId        : Uint4B
   +0x2c8 AppCompatFlags   : _ULARGE_INTEGER
   +0x2d0 AppCompatFlagsUser : _ULARGE_INTEGER
   +0x2d8 pShimData        : Ptr64 Void
   +0x2e0 AppCompatInfo    : Ptr64 Void
   +0x2e8 CSDVersion       : _UNICODE_STRING
   +0x2f8 ActivationContextData : Ptr64 _ACTIVATION_CONTEXT_DATA
   +0x300 ProcessAssemblyStorageMap : Ptr64 _ASSEMBLY_STORAGE_MAP
   +0x308 SystemDefaultActivationContextData : Ptr64 _ACTIVATION_CONTEXT_DATA
   +0x310 SystemAssemblyStorageMap : Ptr64 _ASSEMBLY_STORAGE_MAP
   +0x318 MinimumStackCommit : Uint8B
   +0x320 FlsCallback      : Ptr64 _FLS_CALLBACK_INFO
   +0x328 FlsListHead      : _LIST_ENTRY
   +0x338 FlsBitmap        : Ptr64 Void
   +0x340 FlsBitmapBits    : [4] Uint4B
   +0x350 FlsHighIndex     : Uint4B
   +0x358 WerRegistrationData : Ptr64 Void
   +0x360 WerShipAssertPtr : Ptr64 Void
   +0x368 pContextData     : Ptr64 Void
   +0x370 pImageHeaderHash : Ptr64 Void
   +0x378 TracingFlags     : Uint4B
   +0x378 HeapTracingEnabled : Pos 0, 1 Bit
   +0x378 CritSecTracingEnabled : Pos 1, 1 Bit
   +0x378 SpareTracingBits : Pos 2, 30 Bits
0:000:x86> dt _TEB
ntdll!_TEB
   +0x000 NtTib            : _NT_TIB
   +0x038 EnvironmentPointer : Ptr64 Void
   +0x040 ClientId         : _CLIENT_ID
   +0x050 ActiveRpcHandle  : Ptr64 Void
   +0x058 ThreadLocalStoragePointer : Ptr64 Void
   +0x060 ProcessEnvironmentBlock : Ptr64 _PEB
   +0x068 LastErrorValue   : Uint4B
   +0x06c CountOfOwnedCriticalSections : Uint4B
   +0x070 CsrClientThread  : Ptr64 Void
   +0x078 Win32ThreadInfo  : Ptr64 Void
   +0x080 User32Reserved   : [26] Uint4B
   +0x0e8 UserReserved     : [5] Uint4B
   +0x100 WOW32Reserved    : Ptr64 Void
   +0x108 CurrentLocale    : Uint4B
   +0x10c FpSoftwareStatusRegister : Uint4B
   +0x110 SystemReserved1  : [54] Ptr64 Void
   +0x2c0 ExceptionCode    : Int4B
   +0x2c8 ActivationContextStackPointer : Ptr64 _ACTIVATION_CONTEXT_STACK
   +0x2d0 SpareBytes       : [24] UChar
   +0x2e8 TxFsContext      : Uint4B
   +0x2f0 GdiTebBatch      : _GDI_TEB_BATCH
   +0x7d8 RealClientId     : _CLIENT_ID
   +0x7e8 GdiCachedProcessHandle : Ptr64 Void
   +0x7f0 GdiClientPID     : Uint4B
   +0x7f4 GdiClientTID     : Uint4B
   +0x7f8 GdiThreadLocalInfo : Ptr64 Void
   +0x800 Win32ClientInfo  : [62] Uint8B
   +0x9f0 glDispatchTable  : [233] Ptr64 Void
   +0x1138 glReserved1      : [29] Uint8B
   +0x1220 glReserved2      : Ptr64 Void
   +0x1228 glSectionInfo    : Ptr64 Void
   +0x1230 glSection        : Ptr64 Void
   +0x1238 glTable          : Ptr64 Void
   +0x1240 glCurrentRC      : Ptr64 Void
   +0x1248 glContext        : Ptr64 Void
   +0x1250 LastStatusValue  : Uint4B
   +0x1258 StaticUnicodeString : _UNICODE_STRING
   +0x1268 StaticUnicodeBuffer : [261] Wchar
   +0x1478 DeallocationStack : Ptr64 Void
   +0x1480 TlsSlots         : [64] Ptr64 Void
   +0x1680 TlsLinks         : _LIST_ENTRY
   +0x1690 Vdm              : Ptr64 Void
   +0x1698 ReservedForNtRpc : Ptr64 Void
   +0x16a0 DbgSsReserved    : [2] Ptr64 Void
   +0x16b0 HardErrorMode    : Uint4B
   +0x16b8 Instrumentation  : [11] Ptr64 Void
   +0x1710 ActivityId       : _GUID
   +0x1720 SubProcessTag    : Ptr64 Void
   +0x1728 EtwLocalData     : Ptr64 Void
   +0x1730 EtwTraceData     : Ptr64 Void
   +0x1738 WinSockData      : Ptr64 Void
   +0x1740 GdiBatchCount    : Uint4B
   +0x1744 CurrentIdealProcessor : _PROCESSOR_NUMBER
   +0x1744 IdealProcessorValue : Uint4B
   +0x1744 ReservedPad0     : UChar
   +0x1745 ReservedPad1     : UChar
   +0x1746 ReservedPad2     : UChar
   +0x1747 IdealProcessor   : UChar
   +0x1748 GuaranteedStackBytes : Uint4B
   +0x1750 ReservedForPerf  : Ptr64 Void
   +0x1758 ReservedForOle   : Ptr64 Void
   +0x1760 WaitingOnLoaderLock : Uint4B
   +0x1768 SavedPriorityState : Ptr64 Void
   +0x1770 SoftPatchPtr1    : Uint8B
   +0x1778 ThreadPoolData   : Ptr64 Void
   +0x1780 TlsExpansionSlots : Ptr64 Ptr64 Void
   +0x1788 DeallocationBStore : Ptr64 Void
   +0x1790 BStoreLimit      : Ptr64 Void
   +0x1798 MuiGeneration    : Uint4B
   +0x179c IsImpersonating  : Uint4B
   +0x17a0 NlsCache         : Ptr64 Void
   +0x17a8 pShimData        : Ptr64 Void
   +0x17b0 HeapVirtualAffinity : Uint4B
   +0x17b8 CurrentTransactionHandle : Ptr64 Void
   +0x17c0 ActiveFrame      : Ptr64 _TEB_ACTIVE_FRAME
   +0x17c8 FlsData          : Ptr64 Void
   +0x17d0 PreferredLanguages : Ptr64 Void
   +0x17d8 UserPrefLanguages : Ptr64 Void
   +0x17e0 MergedPrefLanguages : Ptr64 Void
   +0x17e8 MuiImpersonation : Uint4B
   +0x17ec CrossTebFlags    : Uint2B
   +0x17ec SpareCrossTebBits : Pos 0, 16 Bits
   +0x17ee SameTebFlags     : Uint2B
   +0x17ee SafeThunkCall    : Pos 0, 1 Bit
   +0x17ee InDebugPrint     : Pos 1, 1 Bit
   +0x17ee HasFiberData     : Pos 2, 1 Bit
   +0x17ee SkipThreadAttach : Pos 3, 1 Bit
   +0x17ee WerInShipAssertCode : Pos 4, 1 Bit
   +0x17ee RanProcessInit   : Pos 5, 1 Bit
   +0x17ee ClonedThread     : Pos 6, 1 Bit
   +0x17ee SuppressDebugMsg : Pos 7, 1 Bit
   +0x17ee DisableUserStackWalk : Pos 8, 1 Bit
   +0x17ee RtlExceptionAttached : Pos 9, 1 Bit
   +0x17ee InitialThread    : Pos 10, 1 Bit
   +0x17ee SpareSameTebBits : Pos 11, 5 Bits
   +0x17f0 TxnScopeEnterCallback : Ptr64 Void
   +0x17f8 TxnScopeExitCallback : Ptr64 Void
   +0x1800 TxnScopeContext  : Ptr64 Void
   +0x1808 LockCount        : Uint4B
   +0x180c SpareUlong0      : Uint4B
   +0x1810 ResourceRetValue : Ptr64 Void